src/cf/DataProcessors/СозданиеУдаление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СозданиеУдаление</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупочная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/СозданиеУдаление/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ДобавлениеНовыхТоваровНаСервере()
	ГСЧ = Новый ГенераторСлучайныхЧисел; 
	Для Счетчик = 1 По 100 Цикл
		Если Счетчик <= 25 Тогда 
			Группа = Справочники.Номенклатура.НайтиПоНаименованию("Летние");
		ИначеЕсли Счетчик <=50 Тогда     
			Группа = Справочники.Номенклатура.НайтиПоНаименованию("С шипами");
		Иначе     
			Группа = Справочники.Номенклатура.НайтиПоНаименованию("Липучки");
		КонецЕсли;      
		
		НовыйТовар = Справочники.Номенклатура.СоздатьЭлемент();
		НовыйТовар.Наименование = "Товар №" + Счетчик;
		НовыйТовар.Родитель = Группа;
		НовыйТовар.Склад = Справочники.ТорговыеТочки.Оптовый;
		НовыйТовар.ЦенаЗакупочная = ГСЧ.СлучайноеЧисло(500, 2000);
		НовыйТовар.ЦенаПоступления = НовыйТовар.ЦенаЗакупочная * 1.2;
		НовыйТовар.Записать();
	КонецЦикла;      
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхТоваров(Команда)
	ДобавлениеНовыхТоваровНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалениеНовыхТоваровНаСервере()
	Для Счетчик = 1 По 100 Цикл
		СсылкаНаЭлемент = Справочники.Номенклатура.НайтиПоНаименованию("Товар №"+Счетчик+"");
		
		Если НЕ СсылкаНаЭлемент.Пустая() Тогда
			ЭлементПолученный = СсылкаНаЭлемент.ПолучитьОбъект()
			ЭлементПолученный.Удалить(); 
		Иначе 
			Сообщить("Элемент № " + Счетчик + " не найден.");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалениеНовыхТоваров(Команда)
	УдалениеНовыхТоваровНаСервере();
КонецПроцедуры
